{
    "project": {
        "title": "Información del Proyecto",
        "details": "Detalles del Proyecto",
        "category": "Categoría",
        "client": "Cliente",
        "date": "Fecha del Proyecto",
        "url": "URL del Proyecto",
        "gestion-details": "Esta aplicación era el sistema principal de la empresa. Es una aplicación de comercio electrónico, que se adaptó a diferentes tipos de negocio. Mi trabajo como desarrollador, era crear nuevas funcionalidades y mantenimiento de las existentes. Para ello, utilicé Visual Studio 2017+ como IDE, MS SQL Server para gestionar las bases de datos, Git para gestionar mis cambios y combinarlos con el equipo de desarrollo, C# como lenguaje principal, Web API y Web Forms para el front-end (también CSS, HTML y JavaScript) y TRELLO para llevar a cabo nuestras tareas.",
        "modula-details": "En este proyecto, he continuado con el desarrollo de una aplicación de escritorio con C# . Esta aplicación está integrada en una máquina de almacenamiento tipo estantería llamada MODULA. En esta ocasión, la máquina escribe en una base de datos, y la aplicación lee constantemente esta base de datos para realizar una determinada acción en función de lo escrito. Este proyecto se basa en múltiples hilos para realizar diferentes acciones. He utilizado Windows Forms para la interfaz de usuario, el concepto de Threading para esperar una respuesta de y T-SQL para hacer triggers en la base de datos (MS SQL Server), que siempre han sido observados por MODULA para hacer una solicitud o respuesta en función de la acción solicitada.",
        "movie-details": "Es una aplicación web que hice con React. Aquí puedes ver las películas más de moda y hacer una búsqueda de cualquier película que quieras ver. Si quieres detalles de la seleccionada por ti, haciendo click en la pelicula te llevara a otra pagina con los detalles de esa pelicula. Como he mencionado antes, mi objetivo es mejorar mis habilidades en el front-end, así que me picó la curiosidad en esta biblioteca. Seguí un curso para llevar a cabo este proyecto, donde utilicé Visual Studio Code como editor de código, Git para gestionar mi progreso en el código, herramientas como React js, react-create-app, react-router-dom, npm, hooks, The Movie DataBase API para obtener los datos de las películas y técnicas como scroll infinito y debounce para retrasar las llamadas a la API.",
        "quizzGame-details": "Es una aplicación web que hice con Angular. En esta aplicacion podras jugar un juego de preguntas y respuestas. Ademas, tambien podeas crear un usuario para crear tus propios cuestionarios. El almacenamiento de cuestinarios y resgultados del juego lo he hecho con firebase. Ademas tambien lo use para realizar la autenticacion. Mi objetivo fue mejorar mis habilidades en el front-end, utlizando Angular, y realizar este proyecto e2e, es decir, hasta el deploy usando Netlify. Utilize Angular, Angular Material, Bootstrap, AnimateStlye, css loaders, Git, Netlify y  Firebase.",
        "amgyp-details":"En este proyecto, he llevado a cabo el desarrollo de un formulario de registro utilizando ASP NET Web Forms y MS Sql Server. Se registra un nuevo usuario a través de un formulario, y luego permite al usuario cargar cualquier archivo y lo asignó al sistema principal. Después de registrarse, hay un tablero de instrumentos y módulos donde el usuario, después de iniciar sesión, puede interactuar. Este formulario utiliza la API de otro sistema para crear un cliente en su base de datos."
    }
}